## Основные протоколы сети интернет

### Цель:

- Настроить NAT(PAT) на R14 и R15. Трансляция должна осуществляться в адрес автономной системы AS1001
- Настроить NAT(PAT) на R18. Трансляция должна осуществляться в пул из 5 адресов автономной системы AS2042
- Настроить статический NAT для R20
- Настроить NAT так, чтобы R19 был доступен с любого узла для удаленного управления
- Настроить статический NAT(PAT) для офиса Чокурдах
- Настроить DHCP сервер в офисе Москва на маршрутизаторах R12 и R13. VPC1 и VPC7 должны получать сетевые настройки по DHCP
- Настроить NTP сервер на R12 и R13. Все устройства в офисе Москва должны синхронизировать время с R12 и R13
- Все офисы в лабораторной работе должны иметь IP связность



### Топология:

![](lab30-2.svg)

Исправил все сети подключения к провайдеру на маску /29

### Решение:

#### Настроить NAT(PAT) на R14 и R15. Трансляция должна осуществляться в адрес автономной системы AS1001

Настроим PAT на маршрутизаторе R14

Укажем внешние и внутренние интерфейсы

```
R14(config)# int e0/2
R14(config-if)# ip nat outside
R14(config)# int range e0/0, e0/1, e0/3
R14(config-if-range)# ip nat inside
```

Создадим access-list для адресов, которые будут транслироваться

```
R14(config)# access-list 16 permit 172.16.0.0 0.0.255.255
```

Включим трансляцию с перегрузкой для access-list 16 для интерфейса e0/2

```
ip nat inside source list 16 interface Ethernet0/2 overload
```

Настроим аналогично трансляцию на маршрутизаторе R15

Проверим доступность R22 8.8.2.2 c VPC1 172.16.0.10 компьютера в Москве

```
VPCS> ping 8.8.2.2

84 bytes from 8.8.2.2 icmp_seq=1 ttl=251 time=2.059 ms
84 bytes from 8.8.2.2 icmp_seq=2 ttl=251 time=2.553 ms
84 bytes from 8.8.2.2 icmp_seq=3 ttl=251 time=2.096 ms
84 bytes from 8.8.2.2 icmp_seq=4 ttl=251 time=1.904 ms
84 bytes from 8.8.2.2 icmp_seq=5 ttl=251 time=11.944 ms
```

Проверим таблицу трансляции на маршрутизации R15

```
R15#sh ip nat trans
Pro Inside global      Inside local       Outside local      Outside global
icmp 98.0.31.2:3140    172.16.0.10:3140   8.8.2.2:3140       8.8.2.2:3140
icmp 98.0.31.2:3396    172.16.0.10:3396   8.8.2.2:3396       8.8.2.2:3396
icmp 98.0.31.2:3652    172.16.0.10:3652   8.8.2.2:3652       8.8.2.2:3652
icmp 98.0.31.2:3908    172.16.0.10:3908   8.8.2.2:3908       8.8.2.2:3908
icmp 98.0.31.2:4164    172.16.0.10:4164   8.8.2.2:4164       8.8.2.2:4164
```

#### Настроить NAT(PAT) на R18. Трансляция должна осуществляться в пул из 5 адресов автономной системы AS2042

Настроим трансляцию в пул из 5 адресов на маршрутизаторе R18

Укажем внешние и внутренние интерфейсы

```
R18(config)# int range e0/2-3
R18(config-if-range)# ip nat outside
R18(config)# int range e0/0-1
R18(config-if-range)# ip nat inside
```

Создадим access-list для адресов, которые будут транслироваться

```
R18(config)# access-list 17 permit 172.17.0.0 0.0.255.255
```

Укажем пул внешних адресов, в которые будут транслироваться внутренние адреса

```
ip nat pool NAT-POOL-17-1 198.0.52.11 198.0.52.14 netmask 255.255.255.248
```

Включим трансляцию для access-list 17 с пулом внешних адресов NAT-POOL-17-1

```
ip nat inside source list 17 pool NAT-POOL-17-1
```

Проверим доступность R22 8.8.2.2 и R21 8.8.2.1 с компьютеров VPC 172.17.8.20 и VPC8 172.17.0.10 в Санкт-Петербурге

```
 VPCS8> ping 8.8.2.2

84 bytes from 8.8.2.2 icmp_seq=1 ttl=250 time=3.171 ms
84 bytes from 8.8.2.2 icmp_seq=2 ttl=250 time=2.297 ms
84 bytes from 8.8.2.2 icmp_seq=3 ttl=250 time=2.226 ms
84 bytes from 8.8.2.2 icmp_seq=4 ttl=250 time=8.966 ms
84 bytes from 8.8.2.2 icmp_seq=5 ttl=250 time=4.177 ms
```

```
VPCS> ping 8.8.2.1

84 bytes from 8.8.2.1 icmp_seq=1 ttl=251 time=1.782 ms
84 bytes from 8.8.2.1 icmp_seq=2 ttl=251 time=1.732 ms
84 bytes from 8.8.2.1 icmp_seq=3 ttl=251 time=2.309 ms
84 bytes from 8.8.2.1 icmp_seq=4 ttl=251 time=2.194 ms
84 bytes from 8.8.2.1 icmp_seq=5 ttl=251 time=2.410 ms
```

Проверим таблицу трансляции адресов на маршрутизаторе R18

```
R18(config)#do sh ip nat trans
Pro Inside global      Inside local       Outside local      Outside global
icmp 198.0.52.14:51277 172.17.0.10:51277  8.8.2.2:51277      8.8.2.2:51277
icmp 198.0.52.14:51533 172.17.0.10:51533  8.8.2.2:51533      8.8.2.2:51533
icmp 198.0.52.14:51789 172.17.0.10:51789  8.8.2.2:51789      8.8.2.2:51789
icmp 198.0.52.14:52045 172.17.0.10:52045  8.8.2.2:52045      8.8.2.2:52045
icmp 198.0.52.14:52301 172.17.0.10:52301  8.8.2.2:52301      8.8.2.2:52301
--- 198.0.52.14        172.17.0.10        ---                ---
icmp 198.0.52.11:50765 172.17.8.20:50765  8.8.2.1:50765      8.8.2.1:50765
icmp 198.0.52.11:51021 172.17.8.20:51021  8.8.2.1:51021      8.8.2.1:51021
icmp 198.0.52.11:51277 172.17.8.20:51277  8.8.2.1:51277      8.8.2.1:51277
icmp 198.0.52.11:51533 172.17.8.20:51533  8.8.2.1:51533      8.8.2.1:51533
icmp 198.0.52.11:51789 172.17.8.20:51789  8.8.2.1:51789      8.8.2.1:51789
--- 198.0.52.11        172.17.8.20        ---                ---
```

#### Настроить статический NAT для R20

Настроим статический NAT для R20 на маршрутизаторе R15

```
R15 (config)# ip nat inside source static 172.16.32.22 98.0.31.3
```

Проверим доступность R20 c компьютера VPC8 в Санкт-Петербурге

```
VPCS8> ping 98.0.31.3

84 bytes from 98.0.31.3 icmp_seq=1 ttl=249 time=1.935 ms
84 bytes from 98.0.31.3 icmp_seq=2 ttl=249 time=2.090 ms
84 bytes from 98.0.31.3 icmp_seq=3 ttl=249 time=2.561 ms
84 bytes from 98.0.31.3 icmp_seq=4 ttl=249 time=1.914 ms
84 bytes from 98.0.31.3 icmp_seq=5 ttl=249 time=37.961 ms
```

Таблица трансляции на маршрутизаторе R15

```
R15#sh ip nat trans
Pro Inside global      Inside local       Outside local      Outside global
icmp 98.0.31.3:23893   172.16.32.22:23893 198.0.52.14:23893  198.0.52.14:23893
icmp 98.0.31.3:24149   172.16.32.22:24149 198.0.52.14:24149  198.0.52.14:24149
icmp 98.0.31.3:24405   172.16.32.22:24405 198.0.52.14:24405  198.0.52.14:24405
icmp 98.0.31.3:24661   172.16.32.22:24661 198.0.52.14:24661  198.0.52.14:24661
icmp 98.0.31.3:24917   172.16.32.22:24917 198.0.52.14:24917  198.0.52.14:24917
--- 98.0.31.3          172.16.32.22       ---                ---
```

#### Настроить NAT так, чтобы R19 был доступен с любого узла для удаленного управления

Настроим loopback-адрес на маршрутизаторе R19

```
R19(config)# interface Loopback0
R19(config-if)# ip address 172.16.255.19 255.255.255.255
R19(config-if)# ip ospf 1 area 101
```

```
R19(config)# router ospf 1
R19(config-router)# no passive-interface Loopback
```

Настроим на маршрутизаторе R19  возможность подключения по ssh

```
R19(config)# ip domain name ciscolab.con
R19(config)# crypto key generate rsa 1024
R19(config)# username cisco privilege 15 secret 5 class
R19(config)# ip ssh version 2
R19(config)# line vty 0 4
R19(config-line)# login local
R19(config-line)# transport input ssh
```

Настроим статическую трансляцию PAT на маршрутизаторе R15 для подключения к маршрутизатору 

```
ip nat inside source static tcp 172.16.255.19 22 98.0.31.4 50022 extendable
```

 Из внешней сети к маршрутизатору R19 можно будет подключиться по порту адресу 98.0.31.4 и порту 50022

Проверка подключения с маршрутизатора R16 в Санкт-Петербурге:

```
R16#ssh -l cisco -p 50022 98.0.31.4
Password: 

R19#
```

Проверка подключения с маршрутизатора R28 в офисе Чокурдах

```
R28>ssh -l cisco -p 50022 98.0.31.4
Password: 

R19#
```

Проверка подключения с маршрутизатора R13 из локальной сети

```
R13#ssh -l cisco 172.16.255.19
Password: 

R19#
```

#### Настроить статический NAT(PAT) для офиса Чокурдах

Настроим статический NAT на маршрутизаторе R28

Настроим внешние и внутренние интерфейсы для трансляции адресов

```
R28(config)# int range e0/0-1
R28(config-if-range)# ip nat outside
R28(config)# int e0/2
R28(config-if-range)# ip nat inside
```

Настроим трансляцию для адресов 172.18.0.10 VPC30 и 172.18.8.20 VPC31

```
ip nat inside source static 172.18.0.10 198.0.52.35
ip nat inside source static 172.18.8.20 198.0.52.36
```

Таблица трансляции на маршрутизаторе R28

```
R28#sh ip nat trans
Pro Inside global      Inside local       Outside local      Outside global
icmp 198.0.52.35:51303 172.18.0.10:51303  8.8.2.2:51303      8.8.2.2:51303
icmp 198.0.52.35:51559 172.18.0.10:51559  8.8.2.2:51559      8.8.2.2:51559
icmp 198.0.52.35:51815 172.18.0.10:51815  8.8.2.2:51815      8.8.2.2:51815
icmp 198.0.52.35:52071 172.18.0.10:52071  8.8.2.2:52071      8.8.2.2:52071
icmp 198.0.52.35:52327 172.18.0.10:52327  8.8.2.2:52327      8.8.2.2:52327
--- 198.0.52.35        172.18.0.10        ---                ---
icmp 198.0.52.36:53607 172.18.8.20:53607  8.8.2.1:53607      8.8.2.1:53607
icmp 198.0.52.36:53863 172.18.8.20:53863  8.8.2.1:53863      8.8.2.1:53863
icmp 198.0.52.36:54119 172.18.8.20:54119  8.8.2.1:54119      8.8.2.1:54119
icmp 198.0.52.36:54375 172.18.8.20:54375  8.8.2.1:54375      8.8.2.1:54375
icmp 198.0.52.36:54631 172.18.8.20:54631  8.8.2.1:54631      8.8.2.1:54631
--- 198.0.52.36        172.18.8.20        ---                ---
```

#### Настроить DHCP сервер в офисе Москва на маршрутизаторах R12 и R13. VPC1 и VPC7 должны получать сетевые настройки по DHCP

Настроить DHCP-сервер на маршрутизаторах R12 и R13 не удалось, так как коммутаторы SW4 и SW5 не имеют функциональности DHCP Relay (ip helper-address)

Настройки на маршрутизаторах должны были быть следующие:

```
R12(config)# ip dhcp excluded-address 172.16.0.1 172.16.0.9
R12(config)# ip dhcp pool MSK-POOL-0
R12(dhcp-config)# network 172.16.0.0 255.255.254.0
R12(dhcp-config)# default-router 172.16.0.1 
R12(dhcp-config)# domain-name ciscolab.com
```

и

```
R13(config)# ip dhcp excluded-address 172.16.8.1 172.16.8.9
R13(config)# ip dhcp pool MSK-POOL-1
R13(dhcp-config)# network 172.16.8.0 255.255.254.0
R13(dhcp-config)# default-router 172.16.8.1 
R13(dhcp-config)# domain-name ciscolab.com
```

Настройки  DHCP Relay

```
SW4(config)# int e0/0
SW4(config-if)# ip helper-address 172.16.32.25
```

и

```
SW5(config)# int e0/0
SW5(config-if)# ip helper-address 172.16.32.37
```

#### Настроить NTP сервер на R12 и R13. Все устройства в офисе Москва должны синхронизировать время с R12 и R13

Объявляем маршрутизаторы R12 и R13 серверами времени

```
R12(config)# ntp master
R13(config)# ntp master
```

Настраиваем клиентов NTP-сервера

```
R14(config)# ntp server 172.16.32.6
```

Настроим остальных клиентов аналогично